button infomenu = new button(1280-150,720-75,150,75,"Вийти в меню");

void infoScreen(){
  infomenu.draw();
  textAlign(LEFT, TOP);
  fill(0);
  textSize(32);
  text("Правила гри",25,16);
  textSize(16);
  text("Грають двоє.",25,64);
  text("Ігрове поле - квадрат 8х8 клітинок.",25,96);
  text("Гравці по черзі зафарбовують по 1 клітинці.",25,128);
  text("Не можна зафарбовувати вже захоплену клітинку,а також клітинку,",25,128+32);
  text("яка має хоча б одну спільну точку з будь якою захопленою. ",25,128+64);
  text("Програє той хто не зможе зробити хід, або вважає себе переможеним. ",25,128+96);
  
  textSize(32);
  text("Режими гри:",25,256);
  textSize(16);
  text("Гравець проти гравця (Кожен гравець ходить по черзі)",25,256+48);
  text("Комп'ютер проти гравця (Комп'ютер ходить першим)",25,256+80);
  text("Гравець проти комп'ютера (Комп'ютер ходить другим)",25,256+112);
}

void mouseClickedInfo(){
  if(mouseX<infomenu.x+infomenu.w/2 && mouseX>infomenu.x-infomenu.w/2 && mouseY>infomenu.y-infomenu.h/2 && mouseY<infomenu.y+infomenu.h/2){
    Prihvat.screen=0;
  }
}
